In [1]:
import pandas as pd
import numpy as np
pd.__version__

'1.5.2'

# 데이터 집계와 그룹 연산

| 집계 | 설명 |
|------|------|
|`count`|전체 개수|
|`head,tail`|앞의 항목 일부 반환, 뒤의 항목 일부 반환|
|`describe`|Series,DataFrame의 각 컬럼에 대한 요약 통계|
|`min,max`|최소값,최대값|
|`cummin,cummax`|누적 최소값,누적 최대값|
|`argmin,argmax`|최소값과 최대값의 색인 위치|
|`idxmin,idxmax`|최소값과 최대값의 색인값|
|`mean,median`|평균값, 중앙값|
|`std,var`|표준편차, 분산|
|`skew`|왜도값 계산|
|`kurt`|첨도값 계산|
|`mad`|절대 평균 편차|
|`sum,cumsum`|전체 항목 합, 누적합|
|`prod, cumprod`|전체 항목 곱, 누적곱|
|`quantile`|0부터 1까지의 분위수 계산|
|`diff`|1차 산술차 계산|
|`pct_change`|퍼센트 변화율 계산|
|`corr,cov`|상관관계,공분산 계산|

In [2]:
df = pd.DataFrame([[1,1.2,np.nan],
                  [2.4,-5.5,4.2],
                  [np.nan,np.nan,np.nan],
                  [0.44,-3.1,-4.1]],
                 index=[1,2,3,4],
                 columns=['A','B','C']) 
df

      A    B    C
1  1.00  1.2  NaN
2  2.40 -5.5  4.2
3   NaN  NaN  NaN
4  0.44 -3.1 -4.1

In [3]:
df.describe()

              A         B         C
count  3.000000  3.000000  2.000000
mean   1.280000 -2.466667  0.050000
std    1.009554  3.394604  5.868986
min    0.440000 -5.500000 -4.100000
25%    0.720000 -4.300000 -2.025000
50%    1.000000 -3.100000  0.050000
75%    1.700000 -0.950000  2.125000
max    2.400000  1.200000  4.200000

In [4]:
print(df.idxmax())
print(df.idxmin())

A    2
B    1
C    2
dtype: int64
A    4
B    2
C    4
dtype: int64

In [5]:
print(df.std())
print("\n" , df.mean())
print("\n" , df.var())

A    1.009554
B    3.394604
C    5.868986
dtype: float64

 A    1.280000
B   -2.466667
C    0.050000
dtype: float64

 A     1.019200
B    11.523333
C    34.445000
dtype: float64

In [6]:
print(df.skew())
print("\n", df.kurt())

A    1.152070
B    0.810344
C         NaN
dtype: float64

 A   NaN
B   NaN
C   NaN
dtype: float64

In [7]:
print(df.sum())
print("\n" , df.cumsum())

A    3.84
B   -7.40
C    0.10
dtype: float64

       A    B    C
1  1.00  1.2  NaN
2  3.40 -4.3  4.2
3   NaN  NaN  NaN
4  3.84 -7.4  0.1

In [8]:
print(df.sum())
print("\n" , df.cumsum())

A    3.84
B   -7.40
C    0.10
dtype: float64

       A    B    C
1  1.00  1.2  NaN
2  3.40 -4.3  4.2
3   NaN  NaN  NaN
4  3.84 -7.4  0.1

In [9]:
print(df.prod())
print("\n" , df.cumprod())

A     1.056
B    20.460
C   -17.220
dtype: float64

        A      B      C
1  1.000   1.20    NaN
2  2.400  -6.60   4.20
3    NaN    NaN    NaN
4  1.056  20.46 -17.22

In [10]:
df.diff()  # 빼기

     A    B   C
1  NaN  NaN NaN
2  1.4 -6.7 NaN
3  NaN  NaN NaN
4  NaN  NaN NaN

In [11]:
df.quantile()

A    1.00
B   -3.10
C    0.05
Name: 0.5, dtype: float64

In [12]:
df.pct_change()

          A         B        C
1       NaN       NaN      NaN
2  1.400000 -5.583333      NaN
3  0.000000  0.000000  0.00000
4 -0.816667 -0.436364 -1.97619

In [13]:
df.corr()

          A         B    C
A  1.000000 -0.567837  1.0
B -0.567837  1.000000 -1.0
C  1.000000 -1.000000  1.0

In [14]:
df.corrwith(df.B)

A   -0.567837
B    1.000000
C   -1.000000
dtype: float64

In [15]:
df.cov()

        A          B       C
A  1.0192  -1.946000   8.134
B -1.9460  11.523333  -9.960
C  8.1340  -9.960000  34.445

In [16]:
df['B'].unique()

array([ 1.2, -5.5,  nan, -3.1])

In [17]:
df['A'].value_counts()

1.00    1
2.40    1
0.44    1
Name: A, dtype: int64

## Groupby 연산

In [18]:
df = pd.DataFrame({'c1':list('aabbcdb'),
                  'c2' : list('ABBADCC'),
                  'c3' : np.random.randint(1,10,7),
                  'c4' : np.random.rand(7)})
df

  c1 c2  c3        c4
0  a  A   3  0.396911
1  a  B   9  0.773188
2  b  B   4  0.974735
3  b  A   3  0.024320
4  c  D   8  0.978075
5  d  C   7  0.142736
6  b  C   1  0.525929

In [19]:
df.dtypes

c1     object
c2     object
c3      int32
c4    float64
dtype: object

In [20]:
df.groupby(df["c1"]).mean()

C:\Users\chosun\AppData\Local\Temp\ipykernel_17972\2715285365.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(df["c1"]).mean()

          c3        c4
c1
a   6.000000  0.585050
b   2.666667  0.508328
c   8.000000  0.978075
d   7.000000  0.142736

In [21]:
df["c4"].groupby(df["c2"]).std()

c2
A    0.263461
B    0.142515
C    0.270958
D         NaN
Name: c4, dtype: float64

In [27]:
df.groupby([df["c1"],df["c2"]]).mean()

        c3        c4
c1 c2
a  A   3.0  0.396911
   B   9.0  0.773188
b  A   3.0  0.024320
   B   4.0  0.974735
   C   1.0  0.525929
c  D   8.0  0.978075
d  C   7.0  0.142736

In [32]:
df.groupby(["c1","c2"]).mean()  # 이렇게 하는게 훨씬 간편함

        c3        c4
c1 c2
a  A   3.0  0.396911
   B   9.0  0.773188
b  A   3.0  0.024320
   B   4.0  0.974735
   C   1.0  0.525929
c  D   8.0  0.978075
d  C   7.0  0.142736

In [30]:
df["c4"].groupby([df["c1"],df["c2"]]).mean().unstack()

c2         A         B         C         D
c1
a   0.396911  0.773188       NaN       NaN
b   0.024320  0.974735  0.525929       NaN
c        NaN       NaN       NaN  0.978075
d        NaN       NaN  0.142736       NaN

In [33]:
for c1,group in df.groupby('c1'):
    print(c1)
    print(group)

a
  c1 c2  c3        c4
0  a  A   3  0.396911
1  a  B   9  0.773188
b
  c1 c2  c3        c4
2  b  B   4  0.974735
3  b  A   3  0.024320
6  b  C   1  0.525929
c
  c1 c2  c3        c4
4  c  D   8  0.978075
d
  c1 c2  c3        c4
5  d  C   7  0.142736

In [55]:
df[["c4"]].groupby([df['c1'],df['c2'] ]).mean()

             c4
c1 c2
a  A   0.396911
   B   0.773188
b  A   0.024320
   B   0.974735
   C   0.525929
c  D   0.978075
d  C   0.142736

In [57]:
df.groupby(['c1','c2'])[["c4"]].mean()  # 이렇게 하는게 좀 더 나을듯

             c4
c1 c2
a  A   0.396911
   B   0.773188
b  A   0.024320
   B   0.974735
   C   0.525929
c  D   0.978075
d  C   0.142736

In [58]:
df.groupby('c1')['c3'].quantile()

c1
a    6.0
b    3.0
c    8.0
d    7.0
Name: c3, dtype: float64

In [59]:
df.groupby('c1')['c3'].count()

c1
a    2
b    3
c    1
d    1
Name: c3, dtype: int64

In [60]:
df.groupby('c1')['c3'].median()

c1
a    6.0
b    3.0
c    8.0
d    7.0
Name: c3, dtype: float64

In [62]:
df.groupby('c1')['c3'].std()

c1
a    4.242641
b    1.527525
c         NaN
d         NaN
Name: c3, dtype: float64

In [65]:
df.groupby('c1')['c3'].agg(['mean','max','min'])

        mean  max  min
c1
a   6.000000    9    3
b   2.666667    4    1
c   8.000000    8    8
d   7.000000    7    7

In [72]:
df.groupby(['c1','c2'], as_index=False)['c4'].mean()

  c1 c2        c4
0  a  A  0.396911
1  a  B  0.773188
2  b  A  0.024320
3  b  B  0.974735
4  b  C  0.525929
5  c  D  0.978075
6  d  C  0.142736

In [74]:
df.groupby(['c1','c2'], as_index=False).mean()

  c1 c2   c3        c4
0  a  A  3.0  0.396911
1  a  B  9.0  0.773188
2  b  A  3.0  0.024320
3  b  B  4.0  0.974735
4  b  C  1.0  0.525929
5  c  D  8.0  0.978075
6  d  C  7.0  0.142736

In [84]:
df.groupby(['c1','c2'],group_keys=True).mean()

        c3        c4
c1 c2
a  A   3.0  0.396911
   B   9.0  0.773188
b  A   3.0  0.024320
   B   4.0  0.974735
   C   1.0  0.525929
c  D   8.0  0.978075
d  C   7.0  0.142736

In [85]:
df.groupby(['c1','c2'],group_keys=False).mean()

        c3        c4
c1 c2
a  A   3.0  0.396911
   B   9.0  0.773188
b  A   3.0  0.024320
   B   4.0  0.974735
   C   1.0  0.525929
c  D   8.0  0.978075
d  C   7.0  0.142736

In [86]:
df.sort_values(by = 'c1')

  c1 c2  c3        c4
0  a  A   3  0.396911
1  a  B   9  0.773188
2  b  B   4  0.974735
3  b  A   3  0.024320
6  b  C   1  0.525929
4  c  D   8  0.978075
5  d  C   7  0.142736

## 피벗 테이블

In [91]:
df.pivot_table(['c3','c4'],
            index = ['c1'],
            columns=['c2'],
            aggfunc=sum,
             fill_value=0)

   c3                 c4
c2  A  B  C  D         A         B         C         D
c1
a   3  9  0  0  0.396911  0.773188  0.000000  0.000000
b   3  4  1  0  0.024320  0.974735  0.525929  0.000000
c   0  0  0  8  0.000000  0.000000  0.000000  0.978075
d   0  0  7  0  0.000000  0.000000  0.142736  0.000000

In [92]:
pd.crosstab(df.c1,df.c2)

c2  A  B  C  D
c1
a   1  1  0  0
b   1  1  1  0
c   0  0  0  1
d   0  0  1  0

In [100]:
pd.crosstab(df["c1"],df["c2"],values=df["c3"],aggfunc=sum,margins=True)

c2     A     B    C    D  All
c1
a    3.0   9.0  NaN  NaN   12
b    3.0   4.0  1.0  NaN    8
c    NaN   NaN  NaN  8.0    8
d    NaN   NaN  7.0  NaN    7
All  6.0  13.0  8.0  8.0   35

## 범주형 데이터

In [123]:
s = pd.Series(['c1','c2','c1','c2','c1']*2)
s

0    c1
1    c2
2    c1
3    c2
4    c1
5    c1
6    c2
7    c1
8    c2
9    c1
dtype: object

In [124]:
s.unique()

array(['c1', 'c2'], dtype=object)

In [125]:
s.value_counts()

c1    6
c2    4
dtype: int64

In [126]:
code = pd.Series([0,1,0,1]*2)
code

0    0
1    1
2    0
3    1
4    0
5    1
6    0
7    1
dtype: int64

In [127]:
d = pd.Series(['c1','c2'])
d.take(code)

0    c1
1    c2
0    c1
1    c2
0    c1
1    c2
0    c1
1    c2
dtype: object

In [128]:
df = pd.DataFrame({"id" : np.arange(len(s)),
                  'c' : s,
                  "v" : np.random.randint(1000,5000,size=len(s))})
df

   id   c     v
0   0  c1  3237
1   1  c2  4338
2   2  c1  1523
3   3  c2  1133
4   4  c1  4409
5   5  c1  1465
6   6  c2  2486
7   7  c1  3489
8   8  c2  1046
9   9  c1  4306

In [133]:
c =  df['c'].astype("category")
c

0    c1
1    c2
2    c1
3    c2
4    c1
5    c1
6    c2
7    c1
8    c2
9    c1
Name: c, dtype: category
Categories (2, object): ['c1', 'c2']

In [137]:
c.values.codes

array([0, 1, 0, 1, 0, 0, 1, 0, 1, 0], dtype=int8)

In [141]:
c = pd.Categorical(['c1','c2','c3','c1','c2'])
c

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1', 'c2', 'c3']

In [142]:
categories = ['c1','c2','c3']
codes = [0,1,2,0,1]
c = pd.Categorical.from_codes(codes,categories)
c

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1', 'c2', 'c3']

In [143]:
pd.Categorical.from_codes(codes,categories,ordered=True)

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1' < 'c2' < 'c3']

In [144]:
c.as_ordered()

['c1', 'c2', 'c3', 'c1', 'c2']
Categories (3, object): ['c1' < 'c2' < 'c3']

# 문자열 연산

In [147]:
name_tuple = ['Susan lee ', 'Steven Jobs', 'Larry page', 'Elon Must',None,'Bill Gates', 'Mark Zuckerberg','Jeff Bezoes']
names = pd.Series(name_tuple)
names

0         Susan lee
1        Steven Jobs
2         Larry page
3          Elon Must
4               None
5         Bill Gates
6    Mark Zuckerberg
7        Jeff Bezoes
dtype: object

In [151]:
names.str.lower()

0         susan lee
1        steven jobs
2         larry page
3          elon must
4               None
5         bill gates
6    mark zuckerberg
7        jeff bezoes
dtype: object

In [153]:
names.str.len()

0    10.0
1    11.0
2    10.0
3     9.0
4     NaN
5    10.0
6    15.0
7    11.0
dtype: float64

In [154]:
names.str.split()

0          [Susan, lee]
1        [Steven, Jobs]
2         [Larry, page]
3          [Elon, Must]
4                  None
5         [Bill, Gates]
6    [Mark, Zuckerberg]
7        [Jeff, Bezoes]
dtype: object

In [157]:
names.str[0:5]

0    Susan
1    Steve
2    Larry
3    Elon
4     None
5    Bill
6    Mark
7    Jeff
dtype: object

In [163]:
names.str.split().str.get(-1)

0           lee
1          Jobs
2          page
3          Must
4          None
5         Gates
6    Zuckerberg
7        Bezoes
dtype: object

In [164]:
names.str.split().str.get(0)

0     Susan
1    Steven
2     Larry
3      Elon
4      None
5      Bill
6      Mark
7      Jeff
dtype: object

In [165]:
names.str.repeat(2)

0              Susan lee Susan lee
1            Steven JobsSteven Jobs
2              Larry pageLarry page
3                Elon MustElon Must
4                              None
5              Bill GatesBill Gates
6    Mark ZuckerbergMark Zuckerberg
7            Jeff BezoesJeff Bezoes
dtype: object

In [166]:
names.str.join("*")

0              S*u*s*a*n* *l*e*e*
1            S*t*e*v*e*n* *J*o*b*s
2              L*a*r*r*y* *p*a*g*e
3                E*l*o*n* *M*u*s*t
4                             None
5              B*i*l*l* *G*a*t*e*s
6    M*a*r*k* *Z*u*c*k*e*r*b*e*r*g
7            J*e*f*f* *B*e*z*o*e*s
dtype: object